scriptrdotio/stm32/Drivers/BSP/X-NUCLEO-CCA02M1/x_nucleo_cca02m1_audio_l4.c
/******************************************************************************
Static Functions
*******************************************************************************/

/**
* @brief  Initializes the Digital Filter for Sigma-Delta Modulators interface (DFSDM).
* @param  AudioFreq: Audio frequency to be used to set correctly the DFSDM peripheral.
* @retval AUDIO_OK if correct communication, else wrong communication
*/
static uint8_t DFSDMx_Init(uint32_t AudioFreq, uint32_t ChnlNbr) {
  
  uint16_t shift_amount = 0;
  uint32_t SincOrder = 0;
  if(OverSampling(AudioFreq) == 32)
  {
    shift_amount = 12;
    SincOrder = DFSDM_FILTER_SINC5_ORDER;
  }
    else if(OverSampling(AudioFreq) == 128)
  {
    shift_amount = 15;
    SincOrder = DFSDM_FILTER_SINC4_ORDER;
  }
  else if(OverSampling(AudioFreq) == 64)
  {
    shift_amount = 17;
    SincOrder = DFSDM_FILTER_SINC5_ORDER;
  }
    
  /*####AUDIO CH 1: DFSDM CHANNEL 2####*/
  haudio_in_dfsdmchannel[0].Init.OutputClock.Activation   = ENABLE;
  haudio_in_dfsdmchannel[0].Init.OutputClock.Selection    = DFSDM_CHANNEL_OUTPUT_CLOCK_AUDIO;
  /* Set the DFSDM clock OUT audio frequency configuration */
  haudio_in_dfsdmchannel[0].Init.OutputClock.Divider      = ClockDivider(AudioFreq);
  haudio_in_dfsdmchannel[0].Init.Input.Multiplexer        = DFSDM_CHANNEL_EXTERNAL_INPUTS;
  haudio_in_dfsdmchannel[0].Init.Input.DataPacking        = DFSDM_CHANNEL_STANDARD_MODE;
  haudio_in_dfsdmchannel[0].Init.Input.Pins               = DFSDM_CHANNEL_SAME_CHANNEL_PINS;
  haudio_in_dfsdmchannel[0].Init.SerialInterface.Type     = DFSDM_CHANNEL_SPI_RISING;
  haudio_in_dfsdmchannel[0].Init.SerialInterface.SpiClock = DFSDM_CHANNEL_SPI_CLOCK_INTERNAL;
  haudio_in_dfsdmchannel[0].Init.Awd.FilterOrder          = DFSDM_CHANNEL_SINC1_ORDER;
  haudio_in_dfsdmchannel[0].Init.Awd.Oversampling         = 10;
  haudio_in_dfsdmchannel[0].Init.Offset                   = 0;
  haudio_in_dfsdmchannel[0].Init.RightBitShift            = shift_amount;
  haudio_in_dfsdmchannel[0].Instance                      = DFSDM_Channel2;
  
  if(HAL_DFSDM_ChannelGetState(&haudio_in_dfsdmchannel[0]) == HAL_DFSDM_CHANNEL_STATE_RESET)
  {
    /* Init the DFSDM Channel */
    DFSDMx_ChannelMspInit(&haudio_in_dfsdmchannel[0]);
  }
  
  if(HAL_OK != HAL_DFSDM_ChannelInit(&haudio_in_dfsdmchannel[0]))
  {
    return AUDIO_ERROR;
  } 
  
  /*####AUDIO CH 1: FILTER 0####*/
  haudio_in_dfsdmfilter[0].Init.RegularParam.Trigger         = DFSDM_FILTER_SW_TRIGGER;
  haudio_in_dfsdmfilter[0].Init.RegularParam.FastMode        = ENABLE;
  haudio_in_dfsdmfilter[0].Init.RegularParam.DmaMode         = ENABLE;
  haudio_in_dfsdmfilter[0].Init.InjectedParam.Trigger        = DFSDM_FILTER_SW_TRIGGER;
  haudio_in_dfsdmfilter[0].Init.InjectedParam.ScanMode       = DISABLE;
  haudio_in_dfsdmfilter[0].Init.InjectedParam.DmaMode        = DISABLE;
  haudio_in_dfsdmfilter[0].Init.InjectedParam.ExtTrigger     = DFSDM_FILTER_EXT_TRIG_TIM8_TRGO;
  haudio_in_dfsdmfilter[0].Init.InjectedParam.ExtTriggerEdge = DFSDM_FILTER_EXT_TRIG_BOTH_EDGES;
  haudio_in_dfsdmfilter[0].Init.FilterParam.SincOrder        = SincOrder;
  /* Set the DFSDM Filters Oversampling to have correct sample rate */
  haudio_in_dfsdmfilter[0].Init.FilterParam.Oversampling     = OverSampling(AudioFreq);
  haudio_in_dfsdmfilter[0].Init.FilterParam.IntOversampling  = 1;  
  haudio_in_dfsdmfilter[0].Instance                          = AUDIO_IN_DFSDM_1st_FILTER;
  
  if(HAL_DFSDM_FilterGetState(&haudio_in_dfsdmfilter[0]) == HAL_DFSDM_FILTER_STATE_RESET)
  {
    /* Init the DFSDM Filter */
    DFSDMx_FilterMspInit(&haudio_in_dfsdmfilter[0]);
  }
  
  if(HAL_OK != HAL_DFSDM_FilterInit(&haudio_in_dfsdmfilter[0]))
  {
    return AUDIO_ERROR;
  }
  
  /* Configure injected channel */
  if(HAL_OK != HAL_DFSDM_FilterConfigRegChannel(&haudio_in_dfsdmfilter[0], DFSDM_CHANNEL_2, DFSDM_CONTINUOUS_CONV_ON))
  {
    return AUDIO_ERROR;
  }
  
  if (ChnlNbr > 1)
  {  
    /*####AUDIO CH 2: DFSDM CHANNEL 1####*/
    haudio_in_dfsdmchannel[1].Init.OutputClock.Activation   = ENABLE;
    haudio_in_dfsdmchannel[1].Init.OutputClock.Selection    = DFSDM_CHANNEL_OUTPUT_CLOCK_AUDIO;
    /* Set the DFSDM clock OUT audio frequency configuration */
    haudio_in_dfsdmchannel[1].Init.OutputClock.Divider      = ClockDivider(AudioFreq);
    haudio_in_dfsdmchannel[1].Init.Input.Multiplexer        = DFSDM_CHANNEL_EXTERNAL_INPUTS;
    haudio_in_dfsdmchannel[1].Init.Input.DataPacking        = DFSDM_CHANNEL_STANDARD_MODE;
    haudio_in_dfsdmchannel[1].Init.Input.Pins               = DFSDM_CHANNEL_FOLLOWING_CHANNEL_PINS;
    haudio_in_dfsdmchannel[1].Init.SerialInterface.Type     = DFSDM_CHANNEL_SPI_FALLING;
    haudio_in_dfsdmchannel[1].Init.SerialInterface.SpiClock = DFSDM_CHANNEL_SPI_CLOCK_INTERNAL;
    haudio_in_dfsdmchannel[1].Init.Awd.FilterOrder          = DFSDM_CHANNEL_SINC1_ORDER;
    haudio_in_dfsdmchannel[1].Init.Awd.Oversampling         = 10;
    haudio_in_dfsdmchannel[1].Init.Offset                   = 0;
    haudio_in_dfsdmchannel[1].Init.RightBitShift            = shift_amount;
    haudio_in_dfsdmchannel[1].Instance                      = DFSDM_Channel1; 
    
    if(HAL_DFSDM_ChannelGetState(&haudio_in_dfsdmchannel[1]) == HAL_DFSDM_CHANNEL_STATE_RESET)
    {
      /* Init the DFSDM Channel */
      DFSDMx_ChannelMspInit(&haudio_in_dfsdmchannel[1]);
    }    
    if(HAL_OK != HAL_DFSDM_ChannelInit(&haudio_in_dfsdmchannel[1]))
    {
      return AUDIO_ERROR;
    }    
    /*####AUDIO CH 2: FILTER 1####*/
    haudio_in_dfsdmfilter[1].Init.RegularParam.Trigger         = DFSDM_FILTER_SYNC_TRIGGER;
    haudio_in_dfsdmfilter[1].Init.RegularParam.FastMode        = ENABLE;
    haudio_in_dfsdmfilter[1].Init.RegularParam.DmaMode         = ENABLE;
    haudio_in_dfsdmfilter[1].Init.InjectedParam.Trigger        = DFSDM_FILTER_SW_TRIGGER;
    haudio_in_dfsdmfilter[1].Init.InjectedParam.ScanMode       = ENABLE;
    haudio_in_dfsdmfilter[1].Init.InjectedParam.DmaMode        = ENABLE;
    haudio_in_dfsdmfilter[1].Init.InjectedParam.ExtTrigger     = DFSDM_FILTER_EXT_TRIG_TIM8_TRGO;    
    if (ChnlNbr == 1)
    {  
      haudio_in_dfsdmfilter[1].Init.InjectedParam.ExtTriggerEdge = DFSDM_FILTER_EXT_TRIG_RISING_EDGE;
    }
    else
    {
      haudio_in_dfsdmfilter[1].Init.InjectedParam.ExtTriggerEdge = DFSDM_FILTER_EXT_TRIG_BOTH_EDGES;      
    }    
    haudio_in_dfsdmfilter[1].Init.FilterParam.SincOrder        = SincOrder;
    /* Set the DFSDM Filters Oversampling to have correct sample rate */
    haudio_in_dfsdmfilter[1].Init.FilterParam.Oversampling     = OverSampling(AudioFreq);
    haudio_in_dfsdmfilter[1].Init.FilterParam.IntOversampling  = 1;    
    haudio_in_dfsdmfilter[1].Instance                          = AUDIO_IN_DFSDM_2st_FILTER;    
    
    if(HAL_DFSDM_FilterGetState(&haudio_in_dfsdmfilter[1]) == HAL_DFSDM_FILTER_STATE_RESET)
    {
      /* Init the DFSDM Filter */
      DFSDMx_FilterMspInit(&haudio_in_dfsdmfilter[1]);
    }  
    
    if(HAL_OK != HAL_DFSDM_FilterInit(&haudio_in_dfsdmfilter[1]))
    {
      return AUDIO_ERROR;
    }   
    
    /* Configure injected channel */
    if(HAL_OK != HAL_DFSDM_FilterConfigRegChannel(&haudio_in_dfsdmfilter[1], DFSDM_CHANNEL_1, DFSDM_CONTINUOUS_CONV_ON))
    {
      return AUDIO_ERROR;
    }  
  }  
  
  if (ChnlNbr > 2)
  {      
    /*####AUDIO CH 3: CHANNEL 7####*/
    haudio_in_dfsdmchannel[2].Init.OutputClock.Activation   = ENABLE;
    haudio_in_dfsdmchannel[2].Init.OutputClock.Selection    = DFSDM_CHANNEL_OUTPUT_CLOCK_AUDIO;
    /* Set the DFSDM clock OUT audio frequency configuration */
    haudio_in_dfsdmchannel[2].Init.OutputClock.Divider      = ClockDivider(AudioFreq);
    haudio_in_dfsdmchannel[2].Init.Input.Multiplexer        = DFSDM_CHANNEL_EXTERNAL_INPUTS;
    haudio_in_dfsdmchannel[2].Init.Input.DataPacking        = DFSDM_CHANNEL_STANDARD_MODE;
    haudio_in_dfsdmchannel[2].Init.Input.Pins               = DFSDM_CHANNEL_SAME_CHANNEL_PINS;
    haudio_in_dfsdmchannel[2].Init.SerialInterface.Type     = DFSDM_CHANNEL_SPI_RISING;
    haudio_in_dfsdmchannel[2].Init.SerialInterface.SpiClock = DFSDM_CHANNEL_SPI_CLOCK_INTERNAL;
    haudio_in_dfsdmchannel[2].Init.Awd.FilterOrder          = DFSDM_CHANNEL_SINC1_ORDER;
    haudio_in_dfsdmchannel[2].Init.Awd.Oversampling         = 10;
    haudio_in_dfsdmchannel[2].Init.Offset                   = 0;
    haudio_in_dfsdmchannel[2].Init.RightBitShift            = shift_amount;    
    haudio_in_dfsdmchannel[2].Instance                      = DFSDM_Channel7;
    
    if(HAL_DFSDM_ChannelGetState(&haudio_in_dfsdmchannel[2]) == HAL_DFSDM_CHANNEL_STATE_RESET)
    {
      /* Init the DFSDM Channel */
      DFSDMx_ChannelMspInit(&haudio_in_dfsdmchannel[2]);
    }    
    if(HAL_OK != HAL_DFSDM_ChannelInit(&haudio_in_dfsdmchannel[2]))
    {
      return AUDIO_ERROR;
    }  
    
