scriptrdotio/stm32/Drivers/BSP/X-NUCLEO-CCA02M1/x_nucleo_cca02m1_audio_l4.c
    /*####AUDIO CH 3: FILTER 2####*/
    haudio_in_dfsdmfilter[2].Init.RegularParam.Trigger         = DFSDM_FILTER_SYNC_TRIGGER;
    haudio_in_dfsdmfilter[2].Init.RegularParam.FastMode        = ENABLE;
    haudio_in_dfsdmfilter[2].Init.RegularParam.DmaMode         = ENABLE;
    haudio_in_dfsdmfilter[2].Init.InjectedParam.Trigger        = DFSDM_FILTER_SW_TRIGGER;
    haudio_in_dfsdmfilter[2].Init.InjectedParam.ScanMode       = DISABLE;
    haudio_in_dfsdmfilter[2].Init.InjectedParam.DmaMode        = DISABLE;
    haudio_in_dfsdmfilter[2].Init.InjectedParam.ExtTrigger     = DFSDM_FILTER_EXT_TRIG_TIM8_TRGO;
    haudio_in_dfsdmfilter[2].Init.InjectedParam.ExtTriggerEdge = DFSDM_FILTER_EXT_TRIG_BOTH_EDGES;
    haudio_in_dfsdmfilter[2].Init.FilterParam.SincOrder        = SincOrder;
    /* Set the DFSDM Filters Oversampling to have correct sample rate */
    haudio_in_dfsdmfilter[2].Init.FilterParam.Oversampling     = OverSampling(AudioFreq);
    haudio_in_dfsdmfilter[2].Init.FilterParam.IntOversampling  = 1;    
    haudio_in_dfsdmfilter[2].Instance                          = AUDIO_IN_DFSDM_3rd_FILTER;
    
    if(HAL_DFSDM_FilterGetState(&haudio_in_dfsdmfilter[2]) == HAL_DFSDM_FILTER_STATE_RESET)
    {
      /* Init the DFSDM Filter */
      DFSDMx_FilterMspInit(&haudio_in_dfsdmfilter[2]);
    }  
    
    if(HAL_OK != HAL_DFSDM_FilterInit(&haudio_in_dfsdmfilter[2]))
    {
      return AUDIO_ERROR;
    }   
    
    /* Configure injected channel */
    if(HAL_OK != HAL_DFSDM_FilterConfigRegChannel(&haudio_in_dfsdmfilter[2], DFSDM_CHANNEL_7, DFSDM_CONTINUOUS_CONV_ON))
    {
      return AUDIO_ERROR;
    }  
  } 
  
  if (ChnlNbr > 3)
  {     
    /*####AUDIO CH 4: CHANNEL 6####*/
    haudio_in_dfsdmchannel[3].Init.OutputClock.Activation   = ENABLE;
    haudio_in_dfsdmchannel[3].Init.OutputClock.Selection    = DFSDM_CHANNEL_OUTPUT_CLOCK_AUDIO;
    /* Set the DFSDM clock OUT audio frequency configuration */
    haudio_in_dfsdmchannel[3].Init.OutputClock.Divider      = ClockDivider(AudioFreq);
    haudio_in_dfsdmchannel[3].Init.Input.Multiplexer        = DFSDM_CHANNEL_EXTERNAL_INPUTS;
    haudio_in_dfsdmchannel[3].Init.Input.DataPacking        = DFSDM_CHANNEL_STANDARD_MODE;
    haudio_in_dfsdmchannel[3].Init.Input.Pins               = DFSDM_CHANNEL_FOLLOWING_CHANNEL_PINS;
    haudio_in_dfsdmchannel[3].Init.SerialInterface.Type     = DFSDM_CHANNEL_SPI_FALLING;
    haudio_in_dfsdmchannel[3].Init.SerialInterface.SpiClock = DFSDM_CHANNEL_SPI_CLOCK_INTERNAL;
    haudio_in_dfsdmchannel[3].Init.Awd.FilterOrder          = DFSDM_CHANNEL_SINC1_ORDER;
    haudio_in_dfsdmchannel[3].Init.Awd.Oversampling         = 10;
    haudio_in_dfsdmchannel[3].Init.Offset                   = 0;
    haudio_in_dfsdmchannel[3].Init.RightBitShift            = shift_amount;    
    haudio_in_dfsdmchannel[3].Instance                      = DFSDM_Channel6;
    
    if(HAL_DFSDM_ChannelGetState(&haudio_in_dfsdmchannel[3]) == HAL_DFSDM_CHANNEL_STATE_RESET)
    {
      /* Init the DFSDM Channel */
      DFSDMx_ChannelMspInit(&haudio_in_dfsdmchannel[3]);
    }
    
    if(HAL_OK != HAL_DFSDM_ChannelInit(&haudio_in_dfsdmchannel[3]))
    {
      return AUDIO_ERROR;
    }    
    /*####AUDIO CH 4: FILTER 3####*/
    haudio_in_dfsdmfilter[3].Init.RegularParam.Trigger         = DFSDM_FILTER_SYNC_TRIGGER;
    haudio_in_dfsdmfilter[3].Init.RegularParam.FastMode        = ENABLE;
    haudio_in_dfsdmfilter[3].Init.RegularParam.DmaMode         = ENABLE;
    haudio_in_dfsdmfilter[3].Init.InjectedParam.Trigger        = DFSDM_FILTER_SW_TRIGGER;
    haudio_in_dfsdmfilter[3].Init.InjectedParam.ScanMode       = DISABLE;
    haudio_in_dfsdmfilter[3].Init.InjectedParam.DmaMode        = DISABLE;
    haudio_in_dfsdmfilter[3].Init.InjectedParam.ExtTrigger     = DFSDM_FILTER_EXT_TRIG_TIM8_TRGO;
    haudio_in_dfsdmfilter[3].Init.InjectedParam.ExtTriggerEdge = DFSDM_FILTER_EXT_TRIG_BOTH_EDGES;
    haudio_in_dfsdmfilter[3].Init.FilterParam.SincOrder        = SincOrder;
    /* Set the DFSDM Filters Oversampling to have correct sample rate */
    haudio_in_dfsdmfilter[3].Init.FilterParam.Oversampling     = OverSampling(AudioFreq);
    haudio_in_dfsdmfilter[3].Init.FilterParam.IntOversampling  = 1;    
    haudio_in_dfsdmfilter[3].Instance                          = AUDIO_IN_DFSDM_4th_FILTER;
    
    if(HAL_DFSDM_FilterGetState(&haudio_in_dfsdmfilter[3]) == HAL_DFSDM_FILTER_STATE_RESET)
    {
      /* Init the DFSDM Filter */
      DFSDMx_FilterMspInit(&haudio_in_dfsdmfilter[3]);
    }
    
    if(HAL_OK != HAL_DFSDM_FilterInit(&haudio_in_dfsdmfilter[3]))
    {
      return AUDIO_ERROR;
    }
    
    /* Configure injected channel */
    if(HAL_OK != HAL_DFSDM_FilterConfigRegChannel(&haudio_in_dfsdmfilter[3], DFSDM_CHANNEL_6, DFSDM_CONTINUOUS_CONV_ON))
    {
      return AUDIO_ERROR;
    }
  }  
  return AUDIO_OK;
}

/**
* @brief  Initializes the DFSDM channel MSP.
* @param  hdfsdm_channel : DFSDM channel handle.
* @retval None
*/
static void DFSDMx_ChannelMspInit(DFSDM_Channel_HandleTypeDef *hdfsdm_channel) 
{
  GPIO_InitTypeDef GPIO_InitStruct;
  
  /* Enable DFSDM clock */
  AUDIO_IN_DFSDM_CLK_ENABLE();  
  /* Enable GPIO clock */
  AUDIO_IN_DFSDM_CKOUT_GPIO_CLK_ENABLE(); 
  AUDIO_IN_DFSDM_CH12_DATAIN_GPIO_CLK_ENABLE();
  
  /* DFSDM pins configuration: DFSDM_CKOUT, DMIC_DATIN pins ------------------*/
  GPIO_InitStruct.Pin = AUDIO_IN_DFSDM_CKOUT_PIN;
  GPIO_InitStruct.Mode = GPIO_MODE_AF_PP;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_HIGH;
  GPIO_InitStruct.Alternate = AUDIO_IN_DFSDM_CKOUT_DATIN_AF;
  HAL_GPIO_Init(AUDIO_IN_DFSDM_CKOUT_GPIO_PORT, &GPIO_InitStruct);
  
  GPIO_InitStruct.Pin = AUDIO_IN_DFSDM_CH12_DATIN_PIN;
  GPIO_InitStruct.Mode = GPIO_MODE_AF_PP;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_HIGH;
  GPIO_InitStruct.Alternate = AUDIO_IN_DFSDM_CKOUT_DATIN_AF;
  HAL_GPIO_Init(AUDIO_IN_DFSDM_CH12_DATIN_GPIO_PORT, &GPIO_InitStruct);
  
