scriptrdotio/stm32/Drivers/BSP/X-NUCLEO-CCA02M1/x_nucleo_cca02m1_audio_l4.c
  GPIO_InitStruct.Pin = AUDIO_IN_DFSDM_CH34_DATIN_PIN;
  GPIO_InitStruct.Mode = GPIO_MODE_AF_PP;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_HIGH;
  GPIO_InitStruct.Alternate = AUDIO_IN_DFSDM_CKOUT_DATIN_AF;
  HAL_GPIO_Init(AUDIO_IN_DFSDM_CH34_DATIN_GPIO_PORT, &GPIO_InitStruct);
  
}

/**
* @brief  Initializes the DFSDM filter MSP.
* @param  hdfsdm_filter : DFSDM filter handle.
* @retval None
*/
static void DFSDMx_FilterMspInit(DFSDM_Filter_HandleTypeDef *hdfsdm_filter) 

{
  DMA_HandleTypeDef *hdma_dfsdmReg = NULL;
  
  /* Enable DFSDM clock */
  AUDIO_IN_DFSDM_CLK_ENABLE();  
  /* Enable the DMA clock */
  AUDIO_IN_DFSDM_DMA_CLK_ENABLE() ;
  
  if (hdfsdm_filter->Instance == AUDIO_IN_DFSDM_1st_FILTER) 
  {
    hdma_dfsdmReg = &hdma_dfsdmReg_FLT[0];
  } 
  else if (hdfsdm_filter->Instance == AUDIO_IN_DFSDM_2st_FILTER) 
  {
    hdma_dfsdmReg = &hdma_dfsdmReg_FLT[1];
  } 
  else if (hdfsdm_filter->Instance == AUDIO_IN_DFSDM_3rd_FILTER) 
  {
    hdma_dfsdmReg = &hdma_dfsdmReg_FLT[2];
  } 
  else if (hdfsdm_filter->Instance == AUDIO_IN_DFSDM_4th_FILTER) 
  {
    hdma_dfsdmReg = &hdma_dfsdmReg_FLT[3];
  }
  
  /* Configure the hdma_dfsdmReg handle parameters */
  hdma_dfsdmReg->Init.Request = DMA_REQUEST_0;
  hdma_dfsdmReg->Init.Direction = DMA_PERIPH_TO_MEMORY;
  hdma_dfsdmReg->Init.PeriphInc = DMA_PINC_DISABLE;
  hdma_dfsdmReg->Init.MemInc = DMA_MINC_ENABLE;
  hdma_dfsdmReg->Init.PeriphDataAlignment =
    AUDIO_IN_DFSDM_DMA_PERIPH_DATA_SIZE;
  hdma_dfsdmReg->Init.MemDataAlignment = AUDIO_IN_DFSDM_DMA_MEM_DATA_SIZE;
  hdma_dfsdmReg->Init.Mode = DMA_CIRCULAR;
  hdma_dfsdmReg->Init.Priority = DMA_PRIORITY_HIGH;
  
  if (hdfsdm_filter->Instance == AUDIO_IN_DFSDM_1st_FILTER) 
  {
    hdma_dfsdmReg->Instance = AUDIO_IN_DFSDM_DMA_1st_CHANNEL;
  } 
  else if (hdfsdm_filter->Instance == AUDIO_IN_DFSDM_2st_FILTER) 
  {
    hdma_dfsdmReg->Instance = AUDIO_IN_DFSDM_DMA_2nd_CHANNEL;
  } 
  else if (hdfsdm_filter->Instance == AUDIO_IN_DFSDM_3rd_FILTER) 
  {
    hdma_dfsdmReg->Instance = AUDIO_IN_DFSDM_DMA_3rd_CHANNEL;
  } 
  else if (hdfsdm_filter->Instance == AUDIO_IN_DFSDM_4th_FILTER) 
  {
    hdma_dfsdmReg->Instance = AUDIO_IN_DFSDM_DMA_4th_CHANNEL;
  }
  
  /* Associate the DMA handle */
  __HAL_LINKDMA(hdfsdm_filter, hdmaReg, *hdma_dfsdmReg);
  
  /* Reset DMA handle state */
  __HAL_DMA_RESET_HANDLE_STATE(hdma_dfsdmReg);
  
  /* Configure the DMA Channel */
  HAL_DMA_Init(hdma_dfsdmReg);
  
  /* DMA IRQ Channel configuration */
  if (hdfsdm_filter->Instance == AUDIO_IN_DFSDM_1st_FILTER) 
  {
    HAL_NVIC_SetPriority(AUDIO_IN_DFSDM_DMA_1st_CH_IRQn,
                         AUDIO_IN_IRQ_PREPRIO, 0);
    HAL_NVIC_EnableIRQ(AUDIO_IN_DFSDM_DMA_1st_CH_IRQn);
  } 
}

/**
* @brief  Regular conversion complete callback.
* @note   This function performs an HP filter in order to remove DC offset and arranges PCM data following the standard PCM format.
* @param  hdfsdm_filter : DFSDM filter handle.
* @retval None
*/
void HAL_DFSDM_FilterRegConvCpltCallback(DFSDM_Filter_HandleTypeDef *hdfsdm_filter)
{  
  uint32_t i, j = 0;
  
  if (hdfsdm_filter == &haudio_in_dfsdmfilter[0]) 
  {
    for(j=0; j < X_NUCLEO_CCA02M1_Handler.MicChannels; j ++)
    {
      for (i = 0; i < X_NUCLEO_CCA02M1_Handler.Sampling_Freq / 1000; i++)
      {
        X_NUCLEO_CCA02M1_Handler.HP_Filters[j].Z = (RecBuff[j][i + X_NUCLEO_CCA02M1_Handler.Sampling_Freq / 1000] >> 8) * AudioInVolume;
        X_NUCLEO_CCA02M1_Handler.HP_Filters[j].oldOut = (0xFF * (X_NUCLEO_CCA02M1_Handler.HP_Filters[j].oldOut + X_NUCLEO_CCA02M1_Handler.HP_Filters[j].Z - X_NUCLEO_CCA02M1_Handler.HP_Filters[j].oldIn)) / 256;
        X_NUCLEO_CCA02M1_Handler.HP_Filters[j].oldIn = X_NUCLEO_CCA02M1_Handler.HP_Filters[j].Z;
        X_NUCLEO_CCA02M1_Handler.PCM_Data[i * X_NUCLEO_CCA02M1_Handler.MicChannels + j] = SaturaLH(X_NUCLEO_CCA02M1_Handler.HP_Filters[j].oldOut, -32760, 32760);
      }		
    }
    BSP_AUDIO_IN_TransferComplete_CallBack();
  }  
}

/**
* @brief  Half regular conversion complete callback.
* @param  hdfsdm_filter : DFSDM filter handle.
* @retval None
*/
void HAL_DFSDM_FilterRegConvHalfCpltCallback(DFSDM_Filter_HandleTypeDef *hdfsdm_filter) 
{  
  uint32_t i, j = 0;  
  if (hdfsdm_filter == &haudio_in_dfsdmfilter[0]) 
  {
    for(j=0; j < X_NUCLEO_CCA02M1_Handler.MicChannels; j ++)
    {
      for (i = 0; i < X_NUCLEO_CCA02M1_Handler.Sampling_Freq / 1000; i++)
      {
        X_NUCLEO_CCA02M1_Handler.HP_Filters[j].Z = (RecBuff[j][i] >> 8) * AudioInVolume;
        X_NUCLEO_CCA02M1_Handler.HP_Filters[j].oldOut = (0xFF * (X_NUCLEO_CCA02M1_Handler.HP_Filters[j].oldOut + X_NUCLEO_CCA02M1_Handler.HP_Filters[j].Z - X_NUCLEO_CCA02M1_Handler.HP_Filters[j].oldIn)) / 256;
        X_NUCLEO_CCA02M1_Handler.HP_Filters[j].oldIn = X_NUCLEO_CCA02M1_Handler.HP_Filters[j].Z;
        X_NUCLEO_CCA02M1_Handler.PCM_Data[i * X_NUCLEO_CCA02M1_Handler.MicChannels + j] = SaturaLH(X_NUCLEO_CCA02M1_Handler.HP_Filters[j].oldOut, -32760, 32760);        
      }		
    }
    BSP_AUDIO_IN_HalfTransfer_CallBack();
  }
}

/**
* @brief  User callback when record buffer is filled.
* @param  None
* @retval None
*/
__weak void BSP_AUDIO_IN_TransferComplete_CallBack(void) {
  /* This function should be implemented by the user application.
  It is called into this driver when the current buffer is filled
  to prepare the next buffer pointer and its size. */
}

/**
* @brief  User callback when record buffer is half filled.
* @param  None
* @retval None
*/
__weak void BSP_AUDIO_IN_HalfTransfer_CallBack(void) {
  /* This function should be implemented by the user application.
  It is called into this driver when the current buffer is filled
  to prepare the next buffer pointer and its size. */
}

/**
* @}
*/

/**
* @}
*/

/**
* @}
*/

/**
* @}
*/

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
